#### Import relevant libraries

In [2]:
import numpy as np
import pandas as pd
from scipy import stats

#### Load dataset

In [25]:
marketing_sample1 = pd.read_csv("data/marketing_campaign_concat1.csv")
marketing_sample2 = pd.read_csv("data/marketing_campaign_concat2.csv")

#### Inspect the shape of the datasets

In [26]:
marketing_sample1.shape

(2240, 5)

In [27]:
marketing_sample1.head()

     ID  Year_Birth   Education Marital_Status   Income
0  5524        1957  Graduation         Single  58138.0
1  2174        1954  Graduation         Single  46344.0
2  4141        1965  Graduation       Together  71613.0
3  6182        1984  Graduation       Together  26646.0
4  5324        1981         PhD        Married  58293.0

In [28]:
marketing_sample2.shape

(2240, 5)

In [29]:
marketing_sample2.head()

,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth
0,3,8,10,4,7
1,2,1,1,2,5
2,1,8,2,10,4
3,2,2,0,4,6
4,5,5,3,6,5

#### Concatenate the two datasets into one new dataset

In [30]:
concatenated_data = pd.concat([marketing_sample1, marketing_sample2], axis = 1)

In [31]:
concatenated_data.shape

(2240, 10)

In [32]:
concatenated_data

,ID,Year_Birth,Education,Marital_Status,Income,NumDealsPurchases,NumWebPurchases,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth
0,5524,1957,Graduation,Single,58138.0,3,8,10,4,7
1,2174,1954,Graduation,Single,46344.0,2,1,1,2,5
2,4141,1965,Graduation,Together,71613.0,1,8,2,10,4
3,6182,1984,Graduation,Together,26646.0,2,2,0,4,6
4,5324,1981,PhD,Married,58293.0,5,5,3,6,5
...,...,...,...,...,...,...,...,...,...,...
2235,10870,1967,Graduation,Married,61223.0,2,9,3,4,5
2236,4001,1946,PhD,Together,64014.0,7,8,2,5,7
2237,7270,1981,Graduation,Divorced,56981.0,1,2,3,13,6
2238,8235,1956,Master,Together,69245.0,2,6,5,10,3
2239,9405,1954,PhD,Married,52869.0,3,3,1,4,7